Friends | List of all members
ACAPI::MEP::DuctAngleSet Class Referencefinal
MEP Element Manager
The DuctAngleSet contains angles that are used in DuctElbowPreferenceTable and DuctBranchPreferenceTable. More...
#include <MEPDuctAngleSet.hpp>
 Inheritance diagram for ACAPI::MEP::DuctAngleSet:
 Friends
Result< DuctAngleSet >  | GetDuctAngleSet ()
 Additional Inherited Members
 Public Member Functions inherited from ACAPI::MEP::AngleSetBase
bool  | Exists () const
Result< void >  | IsEditable () const
Checks whether the table is editable.
GS::UniString  | GetName () const
uint32_t  | GetSize () const
Result< double >  | GetAngle (uint32_t index) const
Result< bool >  | IsAngleDefined (uint32_t index) const
Checks whether an entry from the angleSet is defined. A angle is defined if at least one preferenceTable has values associated to it.
template<typename ModifierFunc >
Result< void >  | Modify (const ModifierFunc &modifierFunc, const GS::UniString &undoString)
Executes the passed modifier scope in an Undoable command.
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions inherited from ACAPI::MEP::AngleSetBase
AngleSetBase (std::shared_ptr< Impl::IAngleSetBaseImpl > impl)
Constructs a AngleSetBase with the given base implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
The DuctAngleSet contains angles that are used in DuctElbowPreferenceTable and DuctBranchPreferenceTable.
Since
Archicad 29
The container is already initialized and you can access it by calling GetDuctAngleSet.
Example code snippet from Test / New MEP
Take a look at AngleSetBase
Friends And Related Symbol Documentation
◆ GetDuctAngleSet
 Result< DuctAngleSet > GetDuctAngleSet  |  ( |   | )
friend
Returns
If able, returns the DuctAngleSet from the project.